basic/views/reserva/_form.php

<div class="reserva-form">

    <?php
	$var = \yii\helpers\ArrayHelper::map(Vuelo::find()->where('disponibles > 0')->all(), 'id_vuelo', 'nombreVuelo');
---
SELECT * FROM `vuelo` WHERE disponibles > 0