basic/controllers/ReservaController.php

    public function actionCreate()
    {
        $model = new Reserva();
        $model->id_usuario = Yii::$app->user->id;
        try {

        if ($model->load(Yii::$app->request->post())) {
            $vuelo = Vuelo::find($model->id_vuelo)->one();
            Yii::$app->db->createCommand('UPDATE vuelo SET disponibles=disponibles -1 WHERE id_vuelo=:id_vuelo')
            ->bindValue(':id_vuelo', $model->id_vuelo)
            ->execute();
            if($model->save()){
---
SELECT EXISTS(SELECT * FROM `vuelo` WHERE `vuelo`.`id_vuelo`='15')
INSERT INTO `reserva` (`id_usuario`, `id_vuelo`, `nombre_pasajero`, `CI_pasajero`) VALUES ('1', '15', 'pepe', '0503251746')