basic/controllers/VueloController.php

    public function actionCreate()
    {
        $model = new Vuelo();

        if ($model->load(Yii::$app->request->post())) {
            $model->disponibles=$model->puestos;
            if ($model->save()) {
---
INSERT INTO `vuelo` (`puestos`, `nombreVuelo`, `fechaSalida`, `disponibles`) VALUES ('1', 'vuelo dic', '2018-20-12', '1')