basic/models/Users.php

SELECT * FROM `users` WHERE `name`='santy'
---
    public static function findByUsername($username)
    {
        return Users::findOne(['name'=>$username]);